Tekla.Structures.Drawing.SymbolLibrary
The SymbolLibrary class is for handling symbol libraries.

Tekla.Structures.Drawing.SymbolLibrary.GetSymbolLibraries
Gets the names of the available symbol files in the current Tekla Structures
environment, in the "symbols" directory, without the suffix.
Returns: A list of symbol file names or null if failed.

Tekla.Structures.Drawing.SymbolLibrary.GetSymbolLibraries(System.Boolean)
Gets the names of the available symbol files in the current Tekla Structures
environment, in the "symbols" directory, without the suffix.
forceRefresh: If set to true, always lists the files again (slower).
Returns: A list of symbol file names or null if failed.